---
kind: type
id: T:Autodesk.Revit.DB.HermiteFace
source: html/cc020c7b-e36a-7e30-c227-28dbbd520b2d.htm
---
# Autodesk.Revit.DB.HermiteFace

A cubic hermite spline face of a 3d solid or open shell.

## Syntax (C#)
```csharp
public class HermiteFace : Face
```

## Remarks
Hermite faces are defined by cubic hermite spline surfaces bounded by edge loops.
The surfaces provide natural UV parameterization to the faces.